/***********************************************************************
*Copyright (C) 2005 深圳艾科创新有限公司产品应用一部
* All rights reserved.

*File name: 　 SysConfigure.h
*Version:    　0.1
*Author:       cjinzong
*update:       2009-06-11

*Description:
             这个文件是系统配置文件，主要是配置一些平时变化最多的参数。 
     例如：  OSD位置
             系统的模块配置
             等等。。。
*History:
************************************************************************/
#ifndef SYSCONFIGURE_H__
#define SYSCONFIGURE_H__ 

/* ===========================================================
系统软件版本配置，
设置说明:
Release_Ver:表示软件发布版本，主要使用于客户生产时应用。
==============================================================*/
#define Release_Ver  



/*=============================================================
ARK-DEBUG 工具使能开关，如果此开关使能，那么可以通过上位机工具
进行直接用工具进行和软件通讯连接与调试。
===============================================================*/
#ifndef Release_Ver
#define UartPrintfEn
#endif




/*=============================================================
硬件系统信息，表示此软件系统能支持的硬件设备ID。
==============================================================*/
#include "hardware.h"


/*=============================================================
设定当前有效工程
说明: 我们应该每个客户的每个案子都应该进行配置相应的配置文件。
      这样方便我们对项目的管理，和维护。
===============================================================*/
//#define PRJ_AMT_43D_SDK_DEMO   
#define PRJ_AMT_7D_SDK_DEMO

	 
#ifdef PRJ_AMT_43D_SDK_DEMO 
#include "Prj_AMT_43D_SDK_DEMO.h"
#endif

#ifdef PRJ_AMT_7D_SDK_DEMO 
#include "Prj_AMT_7D_SDK_DEMO.h"
#endif

#endif


